# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [1]:
import pandas as pd

In [112]:
df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv")

In [114]:
df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN

In [116]:
df.nunique()
df["Response"].value_counts()

Response
No     8813
Yes    1466
Name: count, dtype: int64

In [118]:
#1
filtered_df = df[(df['Response'] == 'Yes') & (df['Total Claim Amount'] > 1000)]
filtered_df.shape

(67, 26)

In [130]:
#2
yesdf = df[(df['Response'] == 'Yes')]

In [146]:
resultdf = yesdf.groupby(['Policy Type', 'Gender'])['Total Claim Amount'].mean().reset_index()

In [148]:
resultdf.head()

      Policy Type Gender  Total Claim Amount
0  Corporate Auto      F          433.738499
1  Corporate Auto      M          408.582459
2   Personal Auto      F          452.965929
3   Personal Auto      M          457.010178
4    Special Auto      F          453.280164

In [174]:
#3
#Analyze the total number of customers who have policies in each state, 
#and then filter the results to only include states where there are more than 500 customers.
statedf = df.groupby('State')['Customer'].count().reset_index()

In [180]:
df["State"].value_counts()

State
California    3552
Oregon        2909
Arizona       1937
Nevada         993
Washington     888
Name: count, dtype: int64

In [188]:
filtered_state_counts = statedf[statedf['Customer'] > 500]
filtered_state_counts.head()

        State  Customer
0     Arizona      1937
1  California      3552
2      Nevada       993
3      Oregon      2909
4  Washington       888

In [ ]:
#4 Find the maximum, minimum, and median customer lifetime value by education level and gender

In [258]:
meanbyedu = df.groupby(['Education'])['Customer Lifetime Value'].mean().reset_index()

In [260]:
meanbygender = df.groupby(['Gender'])['Customer Lifetime Value'].mean().reset_index()

In [264]:
meanbygender.sort_values(by='Customer Lifetime Value', ascending=False, ignore_index=True)

  Gender  Customer Lifetime Value
0      F              8071.105001
1      M              7963.039566

In [266]:
meanbyedu.sort_values(by='Customer Lifetime Value', ascending=False, ignore_index=True)

              Education  Customer Lifetime Value
0  High School or Below              8415.293805
1                Master              8162.524581
2               College              7900.072700
3              Bachelor              7792.273822
4                Doctor              7372.029537

In [268]:
maxbyedu = df.groupby(['Education'])['Customer Lifetime Value'].max().reset_index()

In [272]:
maxbygender = df.groupby(['Gender'])['Customer Lifetime Value'].max().reset_index()

In [274]:
maxbygender.sort_values(by='Customer Lifetime Value', ascending=False, ignore_index=True)

  Gender  Customer Lifetime Value
0      M              83325.38119
1      F              73225.95652

In [276]:
maxbyedu.sort_values(by='Customer Lifetime Value', ascending=False, ignore_index=True)

              Education  Customer Lifetime Value
0  High School or Below              83325.38119
1              Bachelor              73225.95652
2               College              61850.18803
3                Master              51016.06704
4                Doctor              44856.11397

In [278]:
mindf = df.groupby(['Education', 'Gender'])['Customer Lifetime Value'].min().reset_index()

In [280]:
mindf.sort_values(by='Customer Lifetime Value', ascending=False, ignore_index=True)

              Education Gender  Customer Lifetime Value
0                Master      F              2417.777032
1                Doctor      F              2395.570000
2                Master      M              2272.307310
3                Doctor      M              2267.604038
4  High School or Below      F              2144.921535
5  High School or Below      M              1940.981221
6               College      M              1918.119700
7              Bachelor      F              1904.000852
8               College      F              1898.683686
9              Bachelor      M              1898.007675

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [195]:
# your code goes here